"""Зарегистрируйтесь на одном (или нескольких) из сайтов:
   https://py.checkio.org/ , https://www.codewars.com,
   https://www.hackerrank.com/, https://acmp.ru
   И решите 1-5 задач уровня Elementary и advanced.
   Поместите 3 простых и 2 сложных задачи на Ваш выбор в пул реквест.
"""


""""Дана строка и нужно найти ее первое слово.
    Строка состоит только из английских символов и пробелов.
    В начале и в конце строки пробелов нет.
"""


my_string = input()
s_string = my_string.split()




