"""Шоколадка. на подумать если есть желание. точного решения у меня нет**
   Определения:
   - Шоколадка - прямоугольник, размером n×m (n, m - натуральные). 
   - Разлом - деление шоколадки на две части с натуральными размерами по прямой. 
   - Долька - элемент шоколадки размером 1х1. Очевидно шоколадка состоит из n*m долек.
   - Кусок - элемент шоколадки произвольного (целочисленного размера).
  Определите:
   1) можно ли одним разломом отделить от шоколадки кусок площадью ровно k.
   2) можно ли отломить от шоколадки ровно k долек за некоторое количество разломов.
   3) можно ли отломить от шоколадки ровно k долек с помощью t разломов
"""


# За некоторое количество разломов,
# это подразумевается что за любое количество, но больше чем 1 разлом??

n = int(input("Ширина шоколадки: "))
m = int(input("Длина шоколадки: "))
k = int(input("Заданная площать куска шоколадки: "))


if n * m <= k
    print('Нет, нельзя')
else:
    print('Да, можно')







           


        



  


        

