""" Даны два натуральных числа.
 Вычислите их наибольший общий делитель при помощи
алгоритма Евклида (мы не знаем функции и рекурсию)
"""


import math
print(math.gcd(48, 52))
